[

  {
    "year": "2018",
    "pressItems": [{
        "title": "ADB, Citi Partner on New Risk Product to Help SMEs",
        "description": "The Asian Development Bank (ADB) through its Trade Finance Program (TFP) has signed an agreement with Citi to further support trade across Asia.",
        "url": "/tts/about/press/2018/2018-0510.html",
        "date": "May 10, 2018"
      },
      {
        "title": "Citi Treasury and Trade Solutions Announces New Leadership for North America Commercial Cards and Trade",
        "description": "Citi TTS has made two key appointments for its North America business: Sébastien Delasnerie will head up Commercial Cards, and James Fraser will head up Trade. ",
        "url": "/tts/about/press/2018/2018-0508.html",
        "date": "May 8, 2018"
      },
      {
        "title": "Citi Indonesia Mandated by Coca-Cola Amatil Indonesia as Its Main Bank for Cash Management and Trade Finance Solutions",
        "description": "Citi Indonesia announces that it has been appointed as the main bank for Cash Management and Trade Finance solutions by Coca-Cola Amatil Indonesia (CCAI), the market leader in carbonated beverage and fruit juices in Indonesia. ",
        "url": "/tts/about/press/2018/2018-0213.html",
        "date": "February 13, 2018"
      },
      {
        "title": "CitiDirect BE<sup>&reg;</sup> Ranked #1 Globally in Greenwich Associates Digital Banking Benchmarking Study",
        "description": "Citi Awarded Top Ranking for Twelfth Consecutive Year",
        "url": "/tts/about/press/2018/2018-0205.html",
        "date": "February 5, 2018"
      }

    ]
  },
  {
    "year": "2017",
    "pressItems": [{
        "title": "Citi's WorldLink<sup>&reg;</sup> Payment Services Expands Cross-Currency ACH Offering to 60 Countries",
        "description": "Citi has expanded WorldLink<sup>&reg;</sup> functionality to enable users to send cross-border ACH payments into ten additional markets in the Europe, Middle East and Africa (EMEA) region.",
        "url": "/tts/about/press/2017/2017-1211.html",
        "date": "December 11, 2017"
      },
      {
        "title": "Citi Payer ID Now Available in 44 Countries",
        "description": "Increased Footprint Advances Bank's Strategy to Deliver Simple, Global and Digital Receivables Solutions for Clients.",
        "url": "/tts/about/press/2017/2017-1106.html",
        "date": "November 6, 2017"
      },
      {
        "title": "Citi Integrates SWIFT GPI Tracker With its Payment Flow Manager Platform",
        "description": "Enhanced Tracking Abilities Provide Full Transparency Throughout the Payment Life Cycle to Citi Clients.",
        "url": "/tts/about/press/2017/2017-1017.html",
        "date": "October 17, 2017"
      },
      {
        "title": "FIS and Citi Enable Real-time Payments for Corporate Treasury Customers",
        "description": "Using the CitiConnect<sup>&reg;</sup> application programming interfaces (APIs), FIS has connected its Trax corporate payments factory to the suite of Citi Treasury and Trade Solutions – enabling seamless integration with Citi's core treasury management functionality, including payment initiation, transaction status inquiry, and balance inquiry.",
        "url": "/tts/about/press/2017/2017-1016.html",
        "date": "October 16, 2017"
      },
      {
        "title": "Citi launches a new structure under the \"Advanced Cross-Border Pooling Program\" in China",
        "description": "Citi today announced the successful launch of a new structure under the \"Advanced Cross-Border Pooling Program\" for healthcare enterprise Aland Group.",
        "url": "/tts/about/press/2017/2017-0929.html",
        "date": "September 29, 2017"
      },
      {
        "title": "Citi Commercial Cards Awarded GSA SmartPay<sup>&reg;</sup> 3 Master Contract",
        "description": "Citi has been awarded the GSA SmartPay<sup>&reg;</sup> 3 Master Contract by the U.S. General Services Administration (GSA) to participate in the next generation of the largest global government charge card and payment solutions program. This new contract allows Citi to provide services through 2031.",
        "url": "/tts/about/press/2017/2017-0925.html",
        "date": "September 25, 2017"
      },
      {
        "title": "Citi Appoints Gonca Latif-Schmitt as Global Head of Commercial Cards",
        "description": "The Global Commercial Cards business is a core business for Citi and a key differentiator from other institutions. In this role, she will report to Naveed Sultan, Global Head of Citi's Treasury and Trade Solutions and will continue to be based in New York.",
        "url": "/tts/about/press/2017/2017-0815.html",
        "date": "August 15, 2017"
      },
      {
        "title": "Citi named \"Asia's Best Bank for Transaction Services\" by <em>Euromoney</em> for the second consecutive year",
        "description": "In their citation, <em>Euromoney</em> commented that \"Citi continues to fire on all cylinders across cash management and trade finance. It combines scale and market penetration with innovation, and the sense of drive among senior staff in the region is palpable.\"",
        "url": "/tts/about/press/2017/2017-0724.html",
        "date": "July 24, 2017"
      },
      {
        "title": "Citi Appoints Manish Kohli as Global Head of Payments and Receivables",
        "description": "The Global Payments and Receivables business is a strategic business for Citi and a key differentiator from other institutions. In this role, he will report to Naveed Sultan, Global Head of Citi's Treasury and Trade Solutions and will continue to be based in New York.",
        "url": "/tts/about/press/2017/2017-0530.html",
        "date": "May 30, 2017"
      },
      {
        "title": "Citi China continues to lead in innovative treasury management, partnering clients to win 11 awards at \"2017 Tao Zhu Gong Awards\"",
        "description": "Citi China, together with clients, has been recognized at the Tao Zhu Gong Awards in Beijing for excellence and innovation in treasury management. Established by EuroFinance of The Economist Group, this prestigious annual award is one of the most recognized industry acknowledgements for treasury and financial professionals in China.",
        "url": "/tts/about/press/2017/2017-0525.html",
        "date": "May 25, 2017"
      },
      {
        "title": "NASDAQ and Citi announce Pioneering Blockchain and Global Banking Integration",
        "description": "Nasdaq, Inc. and Citi Treasury and Trade Solutions announced today a new integrated payment solution that enables straight through payment processing and automates reconciliation by using a distributed ledger to record and transmit payment instructions.",
        "url": "/tts/about/press/2017/2017-0522.html",
        "date": "May 22, 2017"
      },
      {
        "title": "Citi Appoints New Innovation Head in Dublin",
        "description": "Citi has announced the appointment of Gulru Atak as Treasury and Trade Solutions (TTS) Dublin Lab and Innovation Head.",
        "url": "/tts/about/press/2017/2017-0516.html",
        "date": "May 16, 2017"
      },
      {
        "title": "Citi Named in Global Finance's \"The Innovators 2017\" Transaction Services List",
        "description": "This honor recognizes Citi's business strategy to deploy the CitiConnect<sup>&reg;</sup> API across 96 countries allowing Citi's treasury services clients to directly connect with Citi to access services using their own Treasury Workstations or Enterprise Resource Platform (ERP) providing convenience, potential cost savings, and reduced risk.",
        "url": "/tts/about/press/2017/2017-0504.html",
        "date": "May 4, 2017"
      },
      {
        "title": "Citi India launches first completely paperless cross-border payment solution for corporates",
        "description": "Payment solution focuses on 'Open Account' cross-border trade which increases transparency, efficiency and reduces turnaround time to less than three hours from the current same day processing.",
        "url": "/tts/about/press/2017/2017-0425.html",
        "date": "April 25, 2017"
      },
      {
        "title": "Citi Innovation Lab in Singapore receives the 'Most Innovative Feature Award' for Citi Interactive Solutions at the global Monarch Innovation Awards",
        "description": "This is the latest award received by the Singapore Lab, which is Citi's only lab in Asia focused on exploring new ideas and service concepts for transaction banking for institutions.",
        "url": "/tts/about/press/2017/2017-0420.html",
        "date": "April 20, 2017"
      },
      {
        "title": "Citi Wins Celent Model Bank Award for Open Banking with CitiConnect<sup>&reg;</sup> API",
        "description": "The solution allows Citi's treasury services clients to directly connect with Citi to access payment initiation, payment status, and account balance inquiries services using their own Treasury Workstations or Enterprise Resource Platform (ERP) resulting in convenience, as well as potential cost savings and reduced risk.",
        "url": "/tts/about/press/2017/2017-0406.html",
        "date": "April 6, 2017"
      },
      {
        "title": "Citi Launches Mobile Password Solution for Treasury and Trade Clients",
        "description": "Citi has launched a new digital solution that eliminates the need for users to carry physical tokens for login.",
        "url": "/tts/about/press/2017/2017-0314.html",
        "date": "March 14, 2017"
      },
      {
        "title": "Citi Releases Risk Management Findings from Treasury Diagnostics Survey",
        "description": "Citi today released the latest Risk Management findings from its award-winning benchmarking tool, Citi Treasury Diagnostics (CTD), designed to help companies assess the effectiveness of their treasury, working capital, and risk management practices.",
        "url": "/tts/about/press/2017/2017-0302.html",
        "date": "March 2, 2017"
      },
      {
        "title": "Citi launches APIs for Treasury Services",
        "description": "Citi's Treasury and Trade Solutions (TTS) has launched an Application Programming Interface (API) solution for payment initiation, payment status, and account balance inquiries through CitiConnect<sup>&reg;</sup>, Citi's industry leading connectivity platform.",
        "url": "/tts/about/press/2017/2017-0228.html",
        "date": "February 28, 2017"
      },
      {
        "title": "CitiDirect BE<sup>&reg;</sup> Ranked #1 in Greenwich Associates Digital Banking Benchmarking Study",
        "description": "The study assesses \"Best of Breed\" features and functionality among online, mobile and direct integration channels that differentiate treasury and cash management providers globally.",
        "url": "/tts/about/press/2017/2017-0221.html",
        "date": "February 21, 2017"
      },
      {
        "title": "Citi Launches App-Based Login Solution for Corporate Clients Across 11 Markets in Asia Pacific",
        "description": "CitiDirect BE<sup>&reg;</sup> via MobilePASS empowers corporate users by conveniently leveraging their personal mobile devices for secure authentication.",
        "url": "/tts/about/press/2017/2017-0125.html",
        "date": "January 25, 2017"
      }
    ]
  },
  {
    "year": "2016",
    "pressItems": [{
        "title": "Citi Retains Top Honor in Global Finance Magazine's 2016 World's Best Digital Bank Awards",
        "description": "The World's Best Digital Bank Awards drew 262 banks globally that were assessed against a wide range of criteria focused on strategy, features and functionality in the online and mobile channels.",
        "url": "/tts/about/press/2016/2016-1114.html",
        "date": "November 14, 2016"
      },
      {
        "title": "Citi Launches Innovative Analytical Tool to Help Institutions Optimize Banking Connectivity and Automate and Digitize Treasury and Shared Service Center Operations",
        "description": "With new Connectivity module in Citi Interactive Solutions, institutions get real-time, in-depth analysis and overview of their treasury and shared service center processes, with the aim to enable greater efficiency and control.",
        "url": "/tts/about/press/2016/2016-1107.html",
        "date": "November 7, 2016"
      },
      {
        "title": "Citi's Global Concentration Engine Expands to Over 50 Markets",
        "description": "\"We are very pleased to reach this significant milestone of our liquidity solution capabilities. It reflects our continued focus to deliver the strength of Citi's global network to our client base, offering them efficient liquidity management capabilities.\"",
        "url": "/tts/about/press/2016/2016-1025.html",
        "date": "October 25, 2016"
      },
      {
        "title": "Citi Enhances Online Investments Portal to Deliver Increased Liquidity Management Options for Clients",
        "description": "These enhancements, consisting of three new capabilities, support Citi's strategy of continued investment to deliver a broad set of liquidity management services that meet clients' changing needs.",
        "url": "/tts/about/press/2016/2016-1024.html",
        "date": "October 24, 2016"
      },
      {
        "title": "Citi Appoints New Canada Sales Head for its Treasury and Trade Solutions Business",
        "description": "Citi has announced the appointment of Hany Naguib into a new Canada Sales Head role for Citi's Treasury and Trade Solutions (TTS) business.",
        "url": "/tts/about/press/2016/2016-1020.html",
        "date": "October 20, 2016"
      },
      {
        "title": "Citi Advances Digital Strategy with Launch of 'eSubmit' in Western Europe",
        "description": "The new offering, to be rolled-out in phases to select Western European countries including Denmark, Finland, Norway, Sweden, Ireland, France, Jersey and the United Kingdom, aims to eliminate the paper intensive process of account opening while speeding-up the overall process of onboarding.",
        "url": "/tts/about/press/2016/2016-1011.html",
        "date": "October 11, 2016"
      },
      {
        "title": "CitiDirect BE<sup>&reg;</sup> Ranked #1 Globally in Greenwich Associates Digital Banking Benchmarking Study",
        "description": "CitiDirect BE<sup>&reg;</sup>, Citi's institutional e-banking platform has been ranked number one in the Greenwich Associates' Digital Banking Benchmarking study for the tenth consecutive year.",
        "url": "/tts/about/press/2016/2016-0614.html",
        "date": "June 14, 2016"
      },
      {
        "title": "Citi Innovation Lab in Singapore receives coveted FinTech Innovation Award",
        "description": "Citi's Highly Commended Award in the \"Innovation in Treasury Management\" category was the only accolade conferred on a global bank and comes on the fifth anniversary of Citi's Treasury and Trade Solutions innovation lab in Singapore.",
        "url": "/tts/about/press/2016/2016-0518.html",
        "date": "May 18, 2016"
      },
      {
        "title": "Boeing Honors Citi with 2015 Supplier of the Year Award",
        "description": "Boeing recognized Citi for its outstanding performance in delivering high-quality products and services and thought leadership in providing commercial card solutions. Citi is the first bank to win this coveted award from Boeing.",
        "url": "/tts/about/press/2016/2016-0418.html",
        "date": "April 18, 2016"
      },
      {
        "title": "Citi's Yawar Shah is presented Lifetime Achievement Award by Global Custodian Magazine",
        "description": "Mr. Shah is a Managing Director and the Head of Plan Implementation at Citi. In this capacity, he leads the management and implementation of a set of key programs globally.",
        "url": "/tts/about/press/2016/2016-0317.html",
        "date": "March 17, 2016"
      },
      {
        "title": "Etihad Airways Signs Citi as International Cash Management Bank Partner",
        "description": "The new mandate, covering Etihad Airways' worldwide operations outside the GCC, will enable the airline to leverage Citi's substantial investment in financial technology to further develop its cash management operations and help reduce costs.",
        "url": "/tts/about/press/2016/2016-0224.html",
        "date": "February 24, 2016"
      },
      {
        "title": "Citi Crosses $1 Trillion Transaction Value Milestone in Institutional Mobile Banking",
        "description": "Citi's Treasury and Trade Solutions has processed over $1Trillion globally, in client transaction value, on CitiDirect BE<sup>&reg;</sup> Mobile and CitiDirect BE<sup>&reg;</sup> Tablet since 2011.",
        "url": "/tts/about/press/2016/2016-0223.html",
        "date": "February 23, 2016"
      }
    ]
  }
]
